
export const chapter1: [string, string][] = [
  ["", "이 이야기는 전쟁에 나가는 남자에 관한 것입니다. 그는 평생을 병사로 지내왔지만, 전쟁 경험은 없었습니다. 이번이 처음입니다."],
  ["", "군대가 소집되었습니다. 예전의 외침입니다: 국가를 지키라, 네 나라를 섬기라. 그래서 남자는 차에 타고 군기지로 향합니다. 아주 먼 곳입니다."],
  ["", "길 가다가 표지판을 보았습니다. 그 위에는 '전선에서 1500 킬로미터 떨어져 있습니다.'라고 적혀 있었습니다."],
  ["", "그는 글러브 컴파트먼트를 열어봅니다. 반쪽만 차 있는 위스키 병이 있습니다. 그는 잔에 조금 따르고 마십니다."],
  ["", "이제 그는 전선에서 1501 킬로미터 떨어져 있습니다."],
  ["", "도착하면 병장 한 명이 그를 기다리고 있습니다."],
  ["Sergeant", "'그래, 너가 병사구나. 어떤 연대야?'"],
  ["Man", "'제27 전차 연대입니다,'"],
  ["Sergeant", "'전차? 우리는 전차가 없어.'"],
  ["Man", "'하지만 저는 제27 전차 연대 출신입니다.'"],
  ["Sergeant", "'우리 여기엔 전차가 없어.'"],
  ["", "남자가 주위를 둘러봅니다. 멀리서 병사들이 걸어가는 것을 보았습니다."],
  ["Man", "'그들은 누구죠?'"],
  ["Sergeant", "'그들은 제32 보병 연대 소속 병사들이야.'"],
  ["Man", "'제9나 제10 연대는 어떻게 됐어요? 그들도 여기 있나요?'"],
  ["Sergeant", "'아니요, 오직 제32 연대만 있어요.'"],
  ["Man", "'그렇다면 우리 연대는 어떤 임무를 수행해야 하나요?'"],
];

const chapter1Options = ["1", "2", "3"];

const chapter1Options1Script = [
  ["", "daaaaa"],
  ["", "asdacacac"],
  ["", "vvasdadafa"],
  ["", "werwergsdfgs"]
];

const chapter1Options2Script = [
  ["", "1"],
  ["", "2"],
  ["", "3"],
];

const chapter1Options3Script = [
  ["", "가"],
  ["", "나"],
  ["", "다"]
];
// AI 생성 스크립트 

// 공통 스크립트 -> 선택지에 따른 짧은 개별 스크립트 -> 공통 스크립트2 -> 선택지에 따른 짧은 개별 스크립트 -> 공통 스크립트 3 -> ....
// 지난 선택지들의 결과에 따른 엔딩 분기. 